{"modelTopology": {"backend": "tensorflow", "model_config": {"config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "sparse": false}, "class_name": "InputLayer"}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 16, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_1", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_2", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "conv2d_4", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_4", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_3", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_5", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_5", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_4", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_6", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 128, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_6", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["add_1", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_5", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_7", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_6", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_8", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "conv2d_9", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_9", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_3", "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_7", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_10", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_10", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_8", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_11", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 256, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_11", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_4", "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["add_3", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_9", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_12", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_12", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_10", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_13", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_13", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "conv2d_14", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_14", "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_5", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_11", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_11", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "activation_11", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_15", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_15", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_12", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"name": "activation_12", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "conv2d_16", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "filters": 512, "trainable": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "conv2d_16", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [3, 3], "activation": "linear", "padding": "same", "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "add_6", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["add_5", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}, "class_name": "Add"}, {"name": "batch_normalization_13", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_13", "beta_constraint": null, "scale": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "average_pooling2d_1", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "pool_size": [8, 8], "trainable": true, "strides": [1, 1], "padding": "same", "data_format": "channels_last"}, "class_name": "AveragePooling2D"}, {"name": "flatten_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "bias_constraint": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "units": 2}, "class_name": "Dense"}, {"name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "use_bias": false, "bias_constraint": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0005000000237487257}, "class_name": "L1L2"}, "units": 101}, "class_name": "Dense"}]}, "class_name": "Model"}, "keras_version": "2.1.6"}, "weightsManifest": [{"paths": ["group1-shard1of24", "group1-shard2of24", "group1-shard3of24", "group1-shard4of24", "group1-shard5of24", "group1-shard6of24", "group1-shard7of24", "group1-shard8of24", "group1-shard9of24", "group1-shard10of24", "group1-shard11of24", "group1-shard12of24", "group1-shard13of24", "group1-shard14of24", "group1-shard15of24", "group1-shard16of24", "group1-shard17of24", "group1-shard18of24", "group1-shard19of24", "group1-shard20of24", "group1-shard21of24", "group1-shard22of24", "group1-shard23of24", "group1-shard24of24"], "weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_12/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_12/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_12/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_12/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_13/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_13/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_13/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_13/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_3/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_3/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_3/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_3/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_6/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_6/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_6/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_6/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_7/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_7/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_7/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_7/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_9/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_9/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_9/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_9/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 16]}, {"name": "conv2d_10/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "conv2d_11/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "conv2d_12/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}, {"name": "conv2d_13/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "conv2d_14/kernel", "dtype": "float32", "shape": [1, 1, 256, 512]}, {"name": "conv2d_15/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "conv2d_16/kernel", "dtype": "float32", "shape": [3, 3, 512, 512]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 16, 128]}, {"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "conv2d_4/kernel", "dtype": "float32", "shape": [1, 1, 16, 128]}, {"name": "conv2d_5/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "conv2d_6/kernel", "dtype": "float32", "shape": [3, 3, 128, 128]}, {"name": "conv2d_7/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "conv2d_8/kernel", "dtype": "float32", "shape": [3, 3, 256, 256]}, {"name": "conv2d_9/kernel", "dtype": "float32", "shape": [1, 1, 128, 256]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [131072, 2]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [131072, 101]}]}]}